app/views/events/_form.html.erb

SELECT "categories".* FROM "categories"
---
<%= f.text_area :description %>
<%= f.select :category_id, Category.all.map{ |c| [c.name, c.id] } %>

SELECT "groups".* FROM "groups"
---

<%= f.collection_check_boxes(:group_ids, Group.all, :id, :name) %>