app/controllers/event_locations_controller.rb

INSERT INTO "locations" ("name", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "taipei"], ["event_id", 2], ["created_at", 2016-07-12 14:39:06 UTC], ["updated_at", 2016-07-12 14:39:06 UTC]]
---
  def create
    @location = @event.build_location( location_params )
    if @location.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def find_event
    @event = Event.find( params[:event_id] )