app/controllers/event_attendees_controller.rb

SELECT  "attendees".* FROM "attendees" WHERE "attendees"."event_id" = ? AND (created_at > '2016-07-05 12:51:13.217137') AND "attendees"."id" = ? ORDER BY id DESC LIMIT ?  [["event_id", 2], ["id", 4], ["LIMIT", 1]]
---
	def show
	  @attendee = @event.attendees.find( params[:id] )

INSERT INTO "attendees" ("name", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sdf"], ["event_id", 3], ["created_at", 2016-07-12 12:49:11 UTC], ["updated_at", 2016-07-12 12:49:11 UTC]]
---
	def create
	  @attendee = @event.attendees.build( attendee_params )
	  if @attendee.save

SELECT  "attendees".* FROM "attendees" WHERE "attendees"."event_id" = ? AND (created_at > '2016-07-05 12:57:02.909073') AND "attendees"."id" = ? ORDER BY id DESC LIMIT ?  [["event_id", 2], ["id", 4], ["LIMIT", 1]]
---
	def edit
	  @attendee = @event.attendees.find( params[:id] )

SELECT  "attendees".* FROM "attendees" WHERE "attendees"."event_id" = ? AND (created_at > '2016-07-05 12:57:04.458045') AND "attendees"."id" = ? ORDER BY id DESC LIMIT ?  [["event_id", 2], ["id", 4], ["LIMIT", 1]]
---
	def update
	  @attendee = @event.attendees.find( params[:id] )

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def find_event
	  @event = Event.find( params[:event_id] )