app/controllers/events_controller.rb

SELECT  "events".* FROM "events" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"
---
	def index
  		@events = Event.page(params[:page]).per(5)

INSERT INTO "events" ("name", "description", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["name", "123123"], ["description", "3123"], ["created_at", 2016-07-12 13:44:33 UTC], ["updated_at", 2016-07-12 13:44:33 UTC], ["category_id", 1]]
---
	def create
	  @event = Event.new(event_params)
	  if @event.save

UPDATE "events" SET "description" = ?, "category_id" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", ""], ["category_id", 1], ["updated_at", 2016-07-12 15:01:18 UTC], ["id", 2]]
---
	def update
	  if @event.update(event_params)